backend/lib/tasks/resetTasks.rake

SELECT "tasks".* FROM "tasks" WHERE (done = TRUE) ORDER BY "tasks"."id" ASC LIMIT $1  [["LIMIT", 1000]]
---
    task resetTasks: :environment do
        puts 'Reset Tasks ....'
        Task.where('done = ?', true).find_each do |t|