backend/app/controllers/api/v1/tasks_controller.rb

        task = Task.new(task_params)
        if task.save
---
UPDATE "tasks" SET "done" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["done", false], ["updated_at", "2021-02-28 20:03:10.068193"], ["id", 3]]
INSERT INTO "tasks" ("title", "image_url", "done", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "task......"], ["image_url", "image......."], ["done", false], ["user_id", 1], ["created_at", "2021-02-24 21:00:35.036873"], ["updated_at", "2021-02-24 21:00:35.036873"]]

    def update
        @task.update(task_params)
---
UPDATE "tasks" SET "done" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["done", false], ["updated_at", "2021-02-25 12:13:08.011396"], ["id", 8]]

    def destroy
        @task.delete
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 40]]