backend/app/controllers/api/v1/users_controller.rb

    def create
        if User.find_by(:name => user_params[:name])
            user = User.find_by(:name => user_params[:name])
            redirect_to "/api/v1/users/#{user.id}"
        else
            user = User.create(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Nasrin"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Mateen"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Nasrin"], ["created_at", "2021-02-20 12:28:47.580948"], ["updated_at", "2021-02-20 12:28:47.580948"]]